#################################################
# 각 문제 아래에 정답 코드를 입력하세요.
# 문제를 해결하는데 필요한 패키지를 로드하세요.
#
# 소속 : 
# 이름 : 
#
#################################################

## ggplot2 패키지의 mpg 데이터를 이용해 문제를 해결하세요(Q1~Q2).

# Q1. 자동차 종류(class)별 빈도와 구성 비율을 오름차순으로 정렬하여 출력하세요.















# Q2. toyota 자동차를 대상으로, 배기량(displ)과 고속도로 연비(hwy)의 관계를 나타낸 산점도를 출력하세요.






# carData 패키지의 Arrests 데이터는 '마리화나 소지자 체포 이력'으로 구성되어 있습니다. carData 패키지를 설치해 불러온 뒤 Arrests 데이터를 이용해 아래 문제를 해결하세요(Q3~Q7).





# Q3. Arrests 데이터를 이용해 어떤 연도에 체포 수가 가장 적었는지 알아보세요.   












# Q4. dplyr 패키지 함수를 이용해 연도별 체포 수를 나타낸 표를 만들어 출력하세요.












# Q5. 연도별 체포 수를 나타낸 선그래프를 출력하세요.



# Q6. 18세 이상은 성인, 18세 미만은 청소년이라고 했을 때, 각 집단의 백분율을 알아보세요.












# Q7. sex는 성별, released는 석방 여부를 나타낸 변수입니다. 성별에 따른 석방 비율을 알아보세요.







# nycflights13 패키지를 이용해 문제를 해결하세요(Q8~Q10).
# install.packages("nycflights13")
library(nycflights13)

# Q8. nycflights13 패키지의 airlines 데이터는 항공사 코드와 항공사명을 담고있습니다. airlines 데이터를 flights 데이터에 결합하세요.







# Q9. 앞에서 생성한 데이터를 이용해 항공사명별 운항 빈도를 내림차순으로 정렬해 출력하세요.









# Q10. UA, B6, DL 항공사(carrier)의 운항 거리(distance)를 나타낸 상자 그림을 출력하세요.






